#### Terraform Workspace 🛠️`vglab`
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/stackhpc/bastion-vglab/runs/run-fEQYWa1dEKiXSnct

Waiting for the plan to start...

Terraform v1.0.0
on linux_amd64
Initializing plugins and modules...
openstack_networking_secgroup_v2.bastion: Refreshing state... [id=6e1c0d2e-c818-4735-aadf-127f533dfc59]
openstack_compute_keypair_v2.bastion: Refreshing state... [id=vglab-bastion]
openstack_networking_secgroup_rule_v2.icmp: Refreshing state... [id=dc2a947f-4b6b-40f6-a51d-33fd4bdf7f49]
openstack_networking_secgroup_rule_v2.ssh: Refreshing state... [id=f90475f7-3c2e-4cb4-906c-2e87fb813e8b]
openstack_networking_secgroup_rule_v2.mosh: Refreshing state... [id=36836f04-62c2-4716-ad34-e8ab415a5b7b]
openstack_networking_port_v2.bastion: Refreshing state... [id=8bc7762a-e03a-4a74-9957-991df8c0c412]
openstack_networking_floatingip_associate_v2.bastion: Refreshing state... [id=087b9a4a-37f2-46b6-95ec-9bc041434654]
openstack_compute_instance_v2.bastion: Refreshing state... [id=aac64e14-f481-4e7b-920c-0a9c7e0475f0]
null_resource.mosh: Refreshing state... [id=697755556500774577]
null_resource.users["kyle"]: Refreshing state... [id=2365215296121393958]
null_resource.users["matta"]: Refreshing state... [id=2692433777623656991]
null_resource.users["jack"]: Refreshing state... [id=8385633247278214094]
null_resource.users["scott"]: Refreshing state... [id=3335143433353152039]
null_resource.users["sms"]: Refreshing state... [id=432833996425079261]
null_resource.users["mattc"]: Refreshing state... [id=6411569643301742233]
null_resource.users["will"]: Refreshing state... [id=4490703186446852803]
null_resource.users["darmach"]: Refreshing state... [id=9045552522322976325]
null_resource.users["tylerc"]: Refreshing state... [id=5577006791947779410]
null_resource.users["stig"]: Refreshing state... [id=5556583377500057621]
null_resource.users["rav"]: Refreshing state... [id=6663103605475417251]
null_resource.users["matt"]: Refreshing state... [id=3770419519672585808]
null_resource.users["michal"]: Refreshing state... [id=5792519979944972212]
null_resource.users["mark"]: Refreshing state... [id=7008629383687971330]
null_resource.users["steveb"]: Refreshing state... [id=1885628518776934862]
null_resource.users["piotr"]: Refreshing state... [id=927701230037707616]
null_resource.users["gbialas"]: Refreshing state... [id=3504092212685804253]
null_resource.users["alex"]: Refreshing state... [id=2531432249346501671]
null_resource.users["gkoper"]: Refreshing state... [id=7878943354179853999]
null_resource.users["slurm-app-ci"]: Refreshing state... [id=2285621751859359749]
null_resource.users["doug"]: Refreshing state... [id=586923400060192147]
null_resource.users["bartosz"]: Refreshing state... [id=6304891766430892889]
null_resource.users["pierre"]: Refreshing state... [id=1050993504834252057]
null_resource.users["dawud"]: Refreshing state... [id=3122895869002529370]
null_resource.sudoers["mark"]: Refreshing state... [id=6407013787846562216]
null_resource.sudoers["bartosz"]: Refreshing state... [id=2144279036750590794]
null_resource.sudoers["michal"]: Refreshing state... [id=4565316302612581726]
null_resource.sudoers["pierre"]: Refreshing state... [id=7633035609129915160]
null_resource.sudoers["piotr"]: Refreshing state... [id=2045693405106008349]
null_resource.unattended-upgrades: Refreshing state... [id=2297255708512143066]
null_resource.sudoers["stig"]: Refreshing state... [id=1815084845282418443]
null_resource.host-key: Refreshing state... [id=6490040199837782451]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # null_resource.host-key must be replaced
-/+ resource "null_resource" "host-key" {
      ~ id       = "6490040199837782451" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "instance"    = "aac64e14-f481-4e7b-920c-0a9c7e0475f0" -> (known after apply)
            # (4 unchanged elements hidden)
        }
    }

  # null_resource.mosh must be replaced
-/+ resource "null_resource" "mosh" {
      ~ id       = "697755556500774577" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "instance"    = "aac64e14-f481-4e7b-920c-0a9c7e0475f0" -> (known after apply)
            # (3 unchanged elements hidden)
        }
    }

  # null_resource.sudoers["bartosz"] must be replaced
-/+ resource "null_resource" "sudoers" {
      ~ id       = "2144279036750590794" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "instance"    = "aac64e14-f481-4e7b-920c-0a9c7e0475f0" -> (known after apply)
            # (3 unchanged elements hidden)
        }
    }

  # null_resource.sudoers["mark"] must be replaced
-/+ resource "null_resource" "sudoers" {
      ~ id       = "6407013787846562216" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "instance"    = "aac64e14-f481-4e7b-920c-0a9c7e0475f0" -> (known after apply)
            # (3 unchanged elements hidden)
        }
    }

  # null_resource.sudoers["michal"] must be replaced
-/+ resource "null_resource" "sudoers" {
      ~ id       = "4565316302612581726" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "instance"    = "aac64e14-f481-4e7b-920c-0a9c7e0475f0" -> (known after apply)
            # (3 unchanged elements hidden)
        }
    }

  # null_resource.sudoers["pierre"] must be replaced
-/+ resource "null_resource" "sudoers" {
      ~ id       = "7633035609129915160" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "instance"    = "aac64e14-f481-4e7b-920c-0a9c7e0475f0" -> (known after apply)
            # (3 unchanged elements hidden)
        }
    }

  # null_resource.sudoers["piotr"] must be replaced
-/+ resource "null_resource" "sudoers" {
      ~ id       = "2045693405106008349" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "instance"    = "aac64e14-f481-4e7b-920c-0a9c7e0475f0" -> (known after apply)
            # (3 unchanged elements hidden)
        }
    }

  # null_resource.sudoers["stig"] must be replaced
-/+ resource "null_resource" "sudoers" {
      ~ id       = "1815084845282418443" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "instance"    = "aac64e14-f481-4e7b-920c-0a9c7e0475f0" -> (known after apply)
            # (3 unchanged elements hidden)
        }
    }

  # null_resource.unattended-upgrades must be replaced
-/+ resource "null_resource" "unattended-upgrades" {
      ~ id       = "2297255708512143066" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "instance"    = "aac64e14-f481-4e7b-920c-0a9c7e0475f0" -> (known after apply)
            # (3 unchanged elements hidden)
        }
    }

  # null_resource.users["alex"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "2531432249346501671" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "instance"        = "aac64e14-f481-4e7b-920c-0a9c7e0475f0" -> (known after apply)
            # (4 unchanged elements hidden)
        }
    }

  # null_resource.users["bartosz"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "6304891766430892889" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "instance"        = "aac64e14-f481-4e7b-920c-0a9c7e0475f0" -> (known after apply)
            # (4 unchanged elements hidden)
        }
    }

  # null_resource.users["darmach"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "9045552522322976325" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "instance"        = "aac64e14-f481-4e7b-920c-0a9c7e0475f0" -> (known after apply)
            # (4 unchanged elements hidden)
        }
    }

  # null_resource.users["dawud"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "3122895869002529370" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "instance"        = "aac64e14-f481-4e7b-920c-0a9c7e0475f0" -> (known after apply)
            # (4 unchanged elements hidden)
        }
    }

  # null_resource.users["doug"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "586923400060192147" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "instance"        = "aac64e14-f481-4e7b-920c-0a9c7e0475f0" -> (known after apply)
            # (4 unchanged elements hidden)
        }
    }

  # null_resource.users["gbialas"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "3504092212685804253" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "instance"        = "aac64e14-f481-4e7b-920c-0a9c7e0475f0" -> (known after apply)
            # (4 unchanged elements hidden)
        }
    }

  # null_resource.users["gkoper"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "7878943354179853999" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "instance"        = "aac64e14-f481-4e7b-920c-0a9c7e0475f0" -> (known after apply)
            # (4 unchanged elements hidden)
        }
    }

  # null_resource.users["jack"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "8385633247278214094" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "instance"        = "aac64e14-f481-4e7b-920c-0a9c7e0475f0" -> (known after apply)
            # (4 unchanged elements hidden)
        }
    }

  # null_resource.users["kyle"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "2365215296121393958" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "instance"        = "aac64e14-f481-4e7b-920c-0a9c7e0475f0" -> (known after apply)
            # (4 unchanged elements hidden)
        }
    }

  # null_resource.users["mark"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "7008629383687971330" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "instance"        = "aac64e14-f481-4e7b-920c-0a9c7e0475f0" -> (known after apply)
            # (4 unchanged elements hidden)
        }
    }

  # null_resource.users["matt"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "3770419519672585808" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "instance"        = "aac64e14-f481-4e7b-920c-0a9c7e0475f0" -> (known after apply)
            # (4 unchanged elements hidden)
        }
    }

  # null_resource.users["matta"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "2692433777623656991" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "instance"        = "aac64e14-f481-4e7b-920c-0a9c7e0475f0" -> (known after apply)
            # (4 unchanged elements hidden)
        }
    }

  # null_resource.users["mattc"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "6411569643301742233" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "instance"        = "aac64e14-f481-4e7b-920c-0a9c7e0475f0" -> (known after apply)
            # (4 unchanged elements hidden)
        }
    }

  # null_resource.users["michal"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "5792519979944972212" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "instance"        = "aac64e14-f481-4e7b-920c-0a9c7e0475f0" -> (known after apply)
            # (4 unchanged elements hidden)
        }
    }

  # null_resource.users["pierre"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "1050993504834252057" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "instance"        = "aac64e14-f481-4e7b-920c-0a9c7e0475f0" -> (known after apply)
            # (4 unchanged elements hidden)
        }
    }

  # null_resource.users["piotr"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "927701230037707616" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "instance"        = "aac64e14-f481-4e7b-920c-0a9c7e0475f0" -> (known after apply)
            # (4 unchanged elements hidden)
        }
    }

  # null_resource.users["rav"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "6663103605475417251" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "instance"        = "aac64e14-f481-4e7b-920c-0a9c7e0475f0" -> (known after apply)
            # (4 unchanged elements hidden)
        }
    }

  # null_resource.users["scott"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "3335143433353152039" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "instance"        = "aac64e14-f481-4e7b-920c-0a9c7e0475f0" -> (known after apply)
            # (4 unchanged elements hidden)
        }
    }

  # null_resource.users["slurm-app-ci"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "2285621751859359749" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "instance"        = "aac64e14-f481-4e7b-920c-0a9c7e0475f0" -> (known after apply)
            # (4 unchanged elements hidden)
        }
    }

  # null_resource.users["sms"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "432833996425079261" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "instance"        = "aac64e14-f481-4e7b-920c-0a9c7e0475f0" -> (known after apply)
            # (4 unchanged elements hidden)
        }
    }

  # null_resource.users["steveb"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "1885628518776934862" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "instance"        = "aac64e14-f481-4e7b-920c-0a9c7e0475f0" -> (known after apply)
            # (4 unchanged elements hidden)
        }
    }

  # null_resource.users["stig"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "5556583377500057621" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "instance"        = "aac64e14-f481-4e7b-920c-0a9c7e0475f0" -> (known after apply)
            # (4 unchanged elements hidden)
        }
    }

  # null_resource.users["tylerc"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "5577006791947779410" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "instance"        = "aac64e14-f481-4e7b-920c-0a9c7e0475f0" -> (known after apply)
            # (4 unchanged elements hidden)
        }
    }

  # null_resource.users["will"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "4490703186446852803" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "instance"        = "aac64e14-f481-4e7b-920c-0a9c7e0475f0" -> (known after apply)
            # (4 unchanged elements hidden)
        }
    }

  # openstack_compute_instance_v2.bastion must be replaced
-/+ resource "openstack_compute_instance_v2" "bastion" {
      ~ access_ip_v4        = "10.0.1.185" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_name         = "general.v1.small" -> (known after apply)
      ~ id                  = "aac64e14-f481-4e7b-920c-0a9c7e0475f0" -> (known after apply)
      ~ image_id            = "34a622a7-703e-4d43-b116-6fe92f04de14" -> "50ee5d40-8dd1-41ac-938e-3459ba56661d" # forces replacement
      ~ image_name          = "Image not found" -> (known after apply)
        name                = "vglab-bastion"
      ~ region              = "RegionOne" -> (known after apply)
      ~ security_groups     = [
          - "SSH",
          - "vglab-bastion",
        ] -> (known after apply)
      - tags                = [] -> null
        # (6 unchanged attributes hidden)

      ~ network {
          ~ fixed_ip_v4    = "10.0.1.185" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:18:64:a1" -> (known after apply)
          ~ name           = "stackhpc-ipv4-geneve" -> (known after apply)
          ~ uuid           = "26023e3d-bc8e-459c-8def-dbd47ab01756" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

Plan: 34 to add, 0 to change, 34 to destroy.

```

</details>

#### Author ✍️@cityofships